base/Catalogs/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок следования статусов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретИзмененияВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_СтатусыОбъектов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
	КонецЕсли; 
	
	ЗаполнитьОбъектСистемы();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
		
	Если НЕ ЭтоГруппа Тогда
		ЗаполнитьОбъектСистемы();
	КонецЕсли; 
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда	
		Возврат;	
	КонецЕсли; 
	
	// Группы связанные с задачами и процессами запрещено редактировать, 
	// т.к. для процессов и задач логика переходов между состояними зафиксирована жестко в коде.
	ЗапрещенныеГруппы = Новый Массив;
	ЗапрещенныеГруппы.Добавить(Справочники.бит_СтатусыОбъектов.СостоянияЗадач);
	ЗапрещенныеГруппы.Добавить(Справочники.бит_СтатусыОбъектов.СостоянияПроцессов);
	
	Если Родитель <> Ссылка.Родитель Тогда		
		Если ЗапрещенныеГруппы.Найти(Родитель) <> Неопределено  Тогда
			ТекстСообщения = НСтр("ru='Изменение состава группы ""%1"" запрещено.';
								  |en='Changing the composition of the ""%1"" group banned'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Родитель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , ,Отказ); 
		КонецЕсли; 
		
		Если ЗапрещенныеГруппы.Найти(Ссылка.Родитель) <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='Изменение состава группы ""%1"" запрещено.';
								  |en='Changing the composition of the ""%1"" group banned'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка.Родитель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , ,Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет оформление в хранилище значения. 
// 
Процедура СохранитьОформление(СтрОформление) Экспорт

	Оформление = Новый ХранилищеЗначения(СтрОформление);

КонецПроцедуры // СохранитьОформление()

// Восстанавливает настройки оформления из хранилища. 
// 
Функция ПолучитьОформление() Экспорт
	
	СтрОформление = Оформление.Получить();
	
	Возврат СтрОформление;
	
КонецФункции // ПолучитьОформление()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОбъектСистемы()
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Поставляемая = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Предопределенный");
		Если Поставляемая Тогда
			ОбъектСистемы = Справочники.бит_СтатусыОбъектов.ОбъектСистемыВГруппе(Родитель);
			Если ЗначениеЗаполнено(ОбъектСистемы) Тогда
				Объект = ОбъектСистемы;		
			КонецЕсли; 	
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
